MS71/ROSZumo/fw/stm32/zumo_tb/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
 * All rights reserved.</center></h2>
 *
 * This software component is licensed by ST under BSD 3-Clause license,
 * the "License"; You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                        opensource.org/licenses/BSD-3-Clause
 *
 ******************************************************************************
 */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "adc.h"
#include "dma.h"
#include "i2c.h"
#include "iwdg.h"
#include "lptim.h"
#include "usart.h"
#include "rtc.h"
#include "spi.h"
#include "tim.h"
#include "gpio.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

#include "config.h"
#include "stm32g0xx_hal_pwr_ex.h"
#ifdef ENABLE_LCD_UI
#include "ui.h"
#endif
#include "pm.h"

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

//#define ENABLE_SEMI_PRINTF

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
/* USER CODE BEGIN PFP */
void FastSystemClock_Config(void);
uint8_t sysfastclock = 0;
extern void initialise_monitor_handles(void);
void vUpdateRSTGPIOs();
void vUpdateRPIGPIOs();

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* Buffer used for reception */
uint8_t ldx_rxbuf;
uint8_t lds_frmidx = 0;
uint8_t lds_frm[22];
#define LDS_POINTS 360
struct
{
	uint8_t data[4];
} lds_data[LDS_POINTS];
struct
{
	uint8_t data[4];
} lds_data_bak[LDS_POINTS];
uint16_t lds_data_bak_cnt = 0;
struct
{
	uint8_t data[4];
} lds_data_i2c[LDS_POINTS];
uint16_t lds_data_i2c_cnt = 0;
uint16_t lds_data_i2c_addr = 0;

/**
  * @brief  Rx Transfer completed callback
  * @param  UartHandle: UART handle
  * @note   This example shows a simple way to report end of DMA Rx transfer, and
  *         you can add your own implementation.
  * @retval None
  */
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart) {
	/*
	22 Bytes: <start> <index> <speed_L> <speed_H> [Data 0] [Data 1] [Data 2] [Data 3] <checksum_L> <checksum_H>

	start is always 0xFA
	index is the index byte in the 90 packets, going from 0xA0 (packet 0, readings 0 to 3) to 0xF9 (packet 89, readings 356 to 359).
	speed is a two-byte information, little-endian. It represents the speed, in 64th of RPM (aka value in RPM represented in fixed point, with 6 bits used for the decimal part).
	[Data 0] to [Data 3] are the 4 readings. Each one is 4 bytes long, and organized as follows :

	`byte 0 : <distance 7:0>`
	`byte 1 : <„invalid data“ flag> <„strength warning“ flag> <distance 13:8>`
	`byte 2 : <signal strength 7:0>`
	`byte 3 : <signal strength 15:8>`
	 */

	lds_frm[lds_frmidx] = ldx_rxbuf;
	if( lds_frm[0] == 0xFA )
	{
		lds_frmidx++;
	}
	if( lds_frmidx == 22 )
	{
		uint32_t chk32 = 0;
		int i;
		for(i=0; i<10; i++)
		{
		    chk32 = (chk32 << 1) + (lds_frm[2*i+0]|lds_frm[2*i+1]<<8);
		}
		chk32 = (chk32 & 0x7FFF) + (chk32 >> 15);
		chk32 &= 0x7FFF;
		if( ((chk32>>0)&0xff) == lds_frm[20] && ((chk32>>8)&0xff) == lds_frm[21] )
		{
			uint8_t index = lds_frm[1];
			double speed = (lds_frm[2] | lds_frm[3]<<8)/64.0;
			struct
			{
				uint8_t  distance;
				uint8_t  invalid;
				uint8_t  strength_warning;
				int16_t  signal;
			} data[4];
			int rpm = API_I2C1_u8Get(I2C_REG_TB_U8_LDS_SPEED);
			if( rpm != 0 )
			{
				if( speed < rpm )
				{
					if( htim16.Instance->CCR1 < 10000 )
						htim16.Instance->CCR1++;
				}
				else if( speed > rpm )
				{
					if( htim16.Instance->CCR1 > 1000 )
						htim16.Instance->CCR1--;
				}
			}
			for(i=0;i<4;i++)
			{
				data[i].distance = (lds_frm[4+4*i+0] | (lds_frm[4+4*i+1]<<8))&0x3fff;
				data[i].invalid = (lds_frm[4+4*i+1]>>7)&1;
				data[i].strength_warning = (lds_frm[4+4*i+1]>>6)&1;
				data[i].signal = lds_frm[4+4*i+2] + (lds_frm[4+4*i+3]<<8);

				int p = (4*(index-0xA0) + i);
				if(p>=0 && p<LDS_POINTS )
				{
					lds_data[p].data[0] = lds_frm[4+4*i+0];
					lds_data[p].data[1] = lds_frm[4+4*i+1];
					lds_data[p].data[2] = lds_frm[4+4*i+2];
					lds_data[p].data[3] = lds_frm[4+4*i+3];
					if( p==(LDS_POINTS-1) )
					{
						memcpy(&lds_data_bak,&lds_data,sizeof(lds_data_bak));
						lds_data_bak_cnt++;
						if( (API_I2C1_u8Get(I2C_REG_TB_U8_INT_ENABLE)&I2C_REG_TB_U8_INT_BIT__LDS_READY) != 0 )
						{
							API_I2C1_u8Set(I2C_REG_TB_U8_INT_FLAGS,API_I2C1_u8Get(I2C_REG_TB_U8_INT_FLAGS)|I2C_REG_TB_U8_INT_BIT__LDS_READY);
						}

					}
				}
			}
#ifdef ENABLE_SEMI_PRINTF
			if( index == 0xA0 )
			{
				printf("0x%02x idx=%02x speed=%3.0f pwm=%d (%d,%d,%d,%d) (%d,%d,%d,%d) (%d,%d,%d,%d) (%d,%d,%d,%d) \n",
						lds_frm[0],
						index,
						speed,htim16.Instance->CCR1,
						data[0].distance,data[0].invalid,data[0].strength_warning,data[0].signal,
						data[1].distance,data[1].invalid,data[1].strength_warning,data[1].signal,
						data[2].distance,data[2].invalid,data[2].strength_warning,data[2].signal,
						data[3].distance,data[3].invalid,data[3].strength_warning,data[3].signal);
			}
#endif
		}
		lds_frm[0] = 0;
		lds_frmidx = 0;
	}

	if (HAL_UART_Receive_IT(&hlpuart1, (uint8_t *)&ldx_rxbuf, 1) != HAL_OK)
	{
		Error_Handler();
	}
}

