MS71/ROSZumo/fw/stm32/zumo_tb/Core/Src/main.c
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */
#ifdef ENABLE_SEMI_PRINTF
  initialise_monitor_handles();
#endif
  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_SPI1_Init();
  MX_TIM1_Init();
  MX_RTC_Init();
  MX_ADC1_Init();
  MX_TIM16_Init();
  MX_LPTIM1_Init();
  MX_IWDG_Init();
  MX_I2C1_Init();
  MX_LPUART1_UART_Init();
  /* USER CODE BEGIN 2 */

  __HAL_RCC_PWR_CLK_ENABLE();

#if 0
  /* Disable Prefetch Buffer */
  __HAL_FLASH_PREFETCH_BUFFER_DISABLE();

  RCC->IOPSMENR  = 0x00u;
  RCC->AHBSMENR  = 0x00u;

  RCC->APBSMENR1 = 0x00u;
  RCC->APBSMENR2 = 0x00u;
#endif

  pm_early_init();

#ifdef HAL_IWDG_MODULE_ENABLED
	HAL_IWDG_Refresh(&hiwdg);
#endif

#if 0
  /* Enable Power Clock */
  __HAL_RCC_PWR_CLK_ENABLE();

  /* Reduce the System clock */
  SystemClock_Decrease();

  /* Set regulator voltage to scale 2 */
  HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE2);

  /* Enter LP RUN Mode */
  HAL_PWREx_EnableLowPowerRunMode();
#endif

  //printf("main() ...\n");

#ifdef ENABLE_LCD_UI
  ui_init();
#endif

  API_I2C1_u16Set(I2C_REG_TB_U16_RPI_DIR,0x0000);
  API_I2C1_u16Set(I2C_REG_TB_U16_RPI_WRITE,0x0000);
  API_I2C1_u16Set(I2C_REG_TB_U16_RPI_READ,0x0000);
  vUpdateRPIGPIOs();

  API_I2C1_Init();

  pm_init();

  /*
  HAL_GPIO_WritePin(O_L_RST_0_GPIO_Port,O_L_RST_0_Pin,GPIO_PIN_RESET);
  HAL_GPIO_WritePin(O_L_RST_1_GPIO_Port,O_L_RST_1_Pin,GPIO_PIN_RESET);
  HAL_GPIO_WritePin(O_L_RST_2_GPIO_Port,O_L_RST_2_Pin,GPIO_PIN_RESET);
  HAL_GPIO_WritePin(O_L_RST_3_GPIO_Port,O_L_RST_3_Pin,GPIO_PIN_RESET);
  HAL_GPIO_WritePin(O_L_RST_4_GPIO_Port,O_L_RST_4_Pin,GPIO_PIN_RESET);
  HAL_GPIO_WritePin(O_L_RST_5_GPIO_Port,O_L_RST_5_Pin,GPIO_PIN_RESET);
  HAL_GPIO_WritePin(O_L_RST_6_GPIO_Port,O_L_RST_6_Pin,GPIO_PIN_RESET);
  HAL_GPIO_WritePin(O_L_RST_7_GPIO_Port,O_L_RST_7_Pin,GPIO_PIN_RESET);
  HAL_GPIO_WritePin(O_L_RST_8_GPIO_Port,O_L_RST_8_Pin,GPIO_PIN_RESET);
  HAL_GPIO_WritePin(O_L_RST_9_GPIO_Port,O_L_RST_9_Pin,GPIO_PIN_RESET);
  HAL_GPIO_WritePin(O_L_RST_10_GPIO_Port,O_L_RST_10_Pin,GPIO_PIN_RESET);
  HAL_GPIO_WritePin(O_L_RST_11_GPIO_Port,O_L_RST_11_Pin,GPIO_PIN_RESET);
  HAL_GPIO_WritePin(O_BNO055_RESET_GPIO_Port,O_BNO055_RESET_Pin,GPIO_PIN_RESET);
*/

  API_I2C1_u16Set(I2C_REG_TB_U16_VL53L1X_RSTREG,0x0000);
  vUpdateRSTGPIOs();

  API_I2C1_u8Set(I2C_REG_TB_U8_WIFIFST,0x00);
  API_I2C1_u32Set(I2C_REG_TB_U32_IPADDR,0x00000000);

  API_I2C1_u8Set(I2C_REG_TB_U8_LDS_SPEED,1);
  API_I2C1_u8Set(I2C_REG_TB_U8_INT_ENABLE,0x00);
  API_I2C1_u8Set(I2C_REG_TB_U8_INT_FLAGS,0x00);

  HAL_TIM_PWM_Start(&htim16, TIM_CHANNEL_1);

#if 1
  if (HAL_UART_Receive_IT(&hlpuart1, (uint8_t *)&ldx_rxbuf, 1) != HAL_OK)
  {
    Error_Handler();
  }
#endif

#if 0
	HAL_Delay(500);

    /* Disable low power run mode and reset the clock to initialization configuration */
    HAL_PWREx_DisableLowPowerRunMode();

    /* Configure the system clock for the RUN mode */
    SystemClock_Config();
#endif

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
	//printf("main() ...\n");
	while (1)
	{
#if 0
		{
			uint8_t buf;
			int n = 0;
			while( HAL_OK == HAL_UART_Receive(&hlpuart1, &buf, 1, 1 ) )
			{
				printf("%02x",buf);
				n++;
			}
			if(n > 0 )
			{
				printf("\n");
			}
		}
#endif

#if 0
		if( bRxBuffer_flag == 1 )
		{
			bRxBuffer_flag = 0;
			printf("%02x%02x%02x%02x%02x%02x%02x%02x\n",
					bRxBuffer[0],
					bRxBuffer[1],
					bRxBuffer[2],
					bRxBuffer[3],
					bRxBuffer[4],
					bRxBuffer[5],
					bRxBuffer[6],
					bRxBuffer[7]);
		}

#endif

#if 0
	{
	    GPIO_InitTypeDef GPIO_InitStruct = {0};
		GPIO_InitStruct.Pin = GPIO_PIN_10;
		GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
		GPIO_InitStruct.Pull = GPIO_NOPULL;
		HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
		HAL_GPIO_TogglePin(GPIOA,GPIO_PIN_10);
	}
#endif

#ifdef ENABLE_SEMI_PRINTF
#if 0
		printf("main() u_bat=%d u_charge=%d temp=%d charge=%d off=%d\n",
				API_I2C1_u16Get(I2C_REG_TB_U16_UBAT_MV),
				API_I2C1_u16Get(I2C_REG_TB_U16_UCHARGE_MV),
				API_I2C1_u16Get(I2C_REG_TB_U16_TEMP_C),
				HAL_GPIO_ReadPin(O_CHARGE_ON_GPIO_Port,O_CHARGE_ON_Pin),
				HAL_GPIO_ReadPin(ZUMO_SHDN_GPIO_Port,ZUMO_SHDN_Pin));
#endif
#endif // ENABLE_SEMI_PRINTF

		//HAL_WWDG_Refresh(WWDG);
		//HAL_IWDG_Refresh(IWDG);

		  //HAL_GPIO_TogglePin(O_LIDAR_M_GPIO_Port, O_LIDAR_M_Pin);

#if 0
	    HAL_GPIO_WritePin(ZUMO_SHDN_GPIO_Port,ZUMO_SHDN_Pin,GPIO_PIN_SET);
		while(1)
		{
		    HAL_GPIO_WritePin(O_CHARGE_ON_GPIO_Port,O_CHARGE_ON_Pin,GPIO_PIN_SET);
			HAL_Delay(1000);
		    HAL_GPIO_WritePin(O_CHARGE_ON_GPIO_Port,O_CHARGE_ON_Pin,GPIO_PIN_RESET);
			HAL_Delay(1000);
		}
#endif

#if 0
		HAL_Delay(5000);

		vStandby();
#endif

#if 0
		HAL_Delay(5000);

		HAL_GPIO_WritePin(O_LED2_GPIO_Port,O_LED2_Pin,GPIO_PIN_RESET);
		HAL_GPIO_WritePin(ZUMO_SHDN_GPIO_Port,ZUMO_SHDN_Pin,GPIO_PIN_SET);

		HAL_SuspendTick();
		HAL_PWR_EnterSTOPMode(PWR_LOWPOWERREGULATOR_ON, PWR_STOPENTRY_WFI);
		HAL_ResumeTick();

		/*
		 * ... Sleeping ...
		 */
		HAL_GPIO_WritePin(ZUMO_SHDN_GPIO_Port,ZUMO_SHDN_Pin,GPIO_PIN_SET);
		HAL_GPIO_WritePin(O_LED2_GPIO_Port,O_LED2_Pin,GPIO_PIN_SET);
		SystemClock_Config();
#endif

		if( API_I2C1_u8Get(I2C_REG_TB_U8_LDS_SPEED) == 0 )
		{
			htim16.Instance->CCR1 = 0;
		}
		else if( htim16.Instance->CCR1 == 0 )
		{
			htim16.Instance->CCR1 = 1000;
		}

		if( (API_I2C1_u8Get(I2C_REG_TB_U8_INT_FLAGS)&API_I2C1_u8Get(I2C_REG_TB_U8_INT_ENABLE)) != 0 )
		{
			HAL_GPIO_WritePin(O_INT_GPIO_Port,O_INT_Pin,GPIO_PIN_RESET);
		}
		else
		{
			HAL_GPIO_WritePin(O_INT_GPIO_Port,O_INT_Pin,GPIO_PIN_SET);
		}

		API_I2C1_u32Set(I2C_REG_TB_U32_LOOP_CNT,API_I2C1_u32Get(I2C_REG_TB_U32_LOOP_CNT)+1);

		vUpdateRSTGPIOs();
		vUpdateRPIGPIOs();

		if( sysfastclock == 1 )
		{
			if( HAL_GPIO_ReadPin(ZUMO_SHDN_GPIO_Port,ZUMO_SHDN_Pin) == GPIO_PIN_SET )
			{
				SystemClock_Config();
				sysfastclock = 0;
			}
		}
		else
		{
			if( HAL_GPIO_ReadPin(ZUMO_SHDN_GPIO_Port,ZUMO_SHDN_Pin) == GPIO_PIN_RESET )
			{
				FastSystemClock_Config();
				sysfastclock = 1;
			}
		}

#ifdef ENABLE_LCD_UI
		ui_loop();
#endif
		pm_loop();

		API_I2C1_Handle();
    /* USER CODE END WHILE */

