MS71/ROSZumo/fw/stm32/zumo_tb/Core/Src/main.c
}

#if 0
struct
{
	uint8_t data[4];
} lds_data_bak[LDS_POINTS];
uint16_t lds_data_bak_cnt = 0;
struct
{
	uint8_t data[4];
} lds_data_i2c[LDS_POINTS];
uint16_t lds_data_i2c_cnt = 0;
uint16_t lds_data_i2c_addr = 0;

#endif

uint8_t HAL_I2C_MemReadCB(uint8_t addr)
{
	if( addr == I2C_REG_TB_U8_LDS_STREAM )
	{
		if( lds_data_i2c_addr == 0 )
		{
			lds_data_i2c_cnt = lds_data_bak_cnt;
			memcpy(&lds_data_i2c,&lds_data_bak,sizeof(lds_data_i2c));
			API_I2C1_u8Set(I2C_REG_TB_U8_LDS_STREAM,(lds_data_i2c_addr>>8)&0xff);
			lds_data_i2c_addr++;
		}
		else if( lds_data_i2c_addr == 1 )
		{
			API_I2C1_u8Set(I2C_REG_TB_U8_LDS_STREAM,(lds_data_i2c_addr>>0)&0xff);
			lds_data_i2c_addr++;
		}
		else if( lds_data_i2c_addr>=2 && lds_data_i2c_addr< (2+(4*LDS_POINTS)) )
		{
			int p = (lds_data_i2c_addr-2)/4;
			API_I2C1_u8Set(I2C_REG_TB_U8_LDS_STREAM,lds_data_i2c[p].data[(lds_data_i2c_addr-2)&3]);
			lds_data_i2c_addr++;
		}
		else
		{
			API_I2C1_u8Set(I2C_REG_TB_U8_LDS_STREAM,0);
		}
	}
	return 1;
}

void HAL_I2C_MemWriteCB(uint8_t addr)
{
	if( addr == I2C_REG_TB_U8_LDS_STREAM )
	{
		lds_data_i2c_addr = 0;
	}
	else if( addr >= I2C_REG_TB_U16_VL53L1X_RSTREG && addr <= (I2C_REG_TB_U16_VL53L1X_RSTREG+1) )
	{
		vUpdateRSTGPIOs();
	}
	else if( addr >= I2C_REG_TB_U16_RPI_DIR && addr <= (I2C_REG_TB_U16_RPI_DIR+1) )
	{
		vUpdateRPIGPIOs();
	}
	else if( addr >= I2C_REG_TB_U16_RPI_READ && addr <= (I2C_REG_TB_U16_RPI_READ+1) )
	{
		vUpdateRPIGPIOs();
	}
	else if( addr >= I2C_REG_TB_U16_RPI_WRITE && addr <= (I2C_REG_TB_U16_RPI_WRITE+1) )
	{
		vUpdateRPIGPIOs();
	}
}

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
	/* User can add his own implementation to report the HAL error return state */
	while(1)
	{
#ifdef O_LED2_Pin
		HAL_GPIO_WritePin(O_LED2_GPIO_Port,O_LED2_Pin,GPIO_PIN_SET);
#endif
		HAL_Delay(100);
#ifdef O_LED2_Pin
		HAL_GPIO_WritePin(O_LED2_GPIO_Port,O_LED2_Pin,GPIO_PIN_RESET);
#endif
		HAL_Delay(100);
	}
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
	/* User can add his own implementation to report the file name and line number,
     tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
